MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0L1227/mcu.h
/* IOMUX_PINCM56[PF] Bits */
#define IOMUX_PINCM56_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM56_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM56_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM56_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM56_PF_UART1_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM56_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM56_PF_TIMG4_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM56_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM56_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM56_PF_UART4_RTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM56_PF_TIMG8_CCP0                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM57[PF] Bits */
#define IOMUX_PINCM57_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM57_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM57_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM57_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM57_PF_UART1_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM57_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM57_PF_TIMG4_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM57_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM57_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)
#define IOMUX_PINCM57_PF_I2C0_SCL                     ((uint32_t)0X00000009)
#define IOMUX_PINCM57_PF_TIMG8_CCP1                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM58[PF] Bits */
#define IOMUX_PINCM58_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM58_PF_GPIOC_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM58_PF_UART3_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM58_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM58_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM58_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM59[PF] Bits */
#define IOMUX_PINCM59_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM59_PF_GPIOC_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM59_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM59_PF_SPI0_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM59_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM60[PF] Bits */
#define IOMUX_PINCM60_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM60_PF_GPIOC_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM60_PF_UART3_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM60_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM60_PF_TIMG5_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM60_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM61[PF] Bits */
#define IOMUX_PINCM61_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM61_PF_GPIOC_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM61_PF_UART3_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM61_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM61_PF_TIMG5_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM61_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM62[PF] Bits */
#define IOMUX_PINCM62_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM62_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM62_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000002)
#define IOMUX_PINCM62_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM62_PF_TIMG12_CCP0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM62_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM62_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM62_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM62_PF_UART2_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM62_PF_I2C0_SDA                     ((uint32_t)0X00000009)

/* IOMUX_PINCM63[PF] Bits */
#define IOMUX_PINCM63_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM63_PF_GPIOB_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM63_PF_UART4_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM63_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM63_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM63_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM63_PF_UART1_TX                     ((uint32_t)0X00000006)

/* IOMUX_PINCM64[PF] Bits */
#define IOMUX_PINCM64_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM64_PF_GPIOB_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM64_PF_UART4_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM64_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM64_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM64_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM64_PF_UART1_RX                     ((uint32_t)0X00000006)

/* IOMUX_PINCM65[PF] Bits */
#define IOMUX_PINCM65_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM65_PF_GPIOB_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM65_PF_UART1_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM65_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM65_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM65_PF_COMP0_OUT                    ((uint32_t)0X00000005)

/* IOMUX_PINCM66[PF] Bits */
#define IOMUX_PINCM66_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM66_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM66_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM66_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM66_PF_TIMG12_CCP1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM66_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM66_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM66_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM66_PF_UART2_RTS                    ((uint32_t)0X00000008)

/* IOMUX_PINCM67[PF] Bits */
#define IOMUX_PINCM67_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM67_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM67_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM67_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM67_PF_I2C2_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM67_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM67_PF_TIMG8_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM67_PF_TIMG5_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM67_PF_UART3_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM67_PF_TIMG0_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM67_PF_SPI1_CS1_POCI1               ((uint32_t)0X0000000A)

/* IOMUX_PINCM68[PF] Bits */
#define IOMUX_PINCM68_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM68_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM68_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM68_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM68_PF_I2C2_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM68_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM68_PF_TIMG8_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM68_PF_TIMG5_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM68_PF_UART3_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM68_PF_TIMG0_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM68_PF_SPI1_CS2_POCI2               ((uint32_t)0X0000000A)

/* IOMUX_PINCM69[PF] Bits */
#define IOMUX_PINCM69_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM69_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM69_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM69_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM69_PF_TIMG12_CCP1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM69_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM69_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM69_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM69_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM69_PF_UART3_TX                     ((uint32_t)0X00000009)
#define IOMUX_PINCM69_PF_TIMG4_CCP0                   ((uint32_t)0X0000000A)

